# GetStartConstraint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetStartConstraint Method
RebarUpdateCurvesData Class See Also
---
Gets the current constraint for the start handle of the Rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public RebarConstraint GetStartConstraint()
```

Visual Basic
---
```text
Public Function GetStartConstraint As RebarConstraint
```

Visual C++
---
```text
public:
RebarConstraint^ GetStartConstraint()
```

# ### Return Value
Returns the current constraint for the start handle of the Rebar. Return value is null if no constraint is present.
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace